Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/extra_social_welfare_benefits/fuel_allowance.html.txt.tmx
Source language: en
Languages: ga

source: A Fuel Allowance is a payment under the National Fuel Scheme to help with the cost of heating your home during the winter months
ga: Íocaíocht atá i Liúntas Breosla faoin Scéim Náisiúnta Breosla chun cabhrú leis an gcostas a bhíonn ar do theach a théamh i rith mhíonna an gheimhridh

source: It is paid to people who are dependent on long-term social welfare payments and who are unable to provide for their own heating needs
ga: Íoctar é le daoine a bhraitheann ar íocaíochtaí fadtéarmacha leasa shóisialaigh agus nach bhfuil in ann íoc as a riachtanais féin téimh

source: Only one Fuel Allowance is paid to a household
ga: Ní íoctar ach Liúntas Breosla amháin le teaghlach

source: The 2016-2017 Fuel Allowance season started on Monday 3 October 2016 and ended on Friday 31 March 2017
ga: Cuirtear tús le séasúr Liúntas Breosla 2016-2017 Dé Luain, an 3 Deireadh Fómhair 2016 agus cuirtear deireadh leis Aoine, an 31 Máirt 2017

source: The 2017-2018 season will begin on Monday 2 October 2017
ga: Íoctar Liúntas Breosla le d’íocaíocht leasa shóisialaigh ar an lá is gnách duit íocaíocht a fháil

source: The Department of Social Protection has published information on what to do if you are in financial difficulty with your energy bills
ga: D’fhoilsigh an Roinn Coimirce Sóisialaí faisnéis ar an méid is gá duit a dhéanamh má tá deacracht airgeadais agat le do chuid billí fuinnimh

source: Some UK pensioners living in Ireland may be eligible for a Winter Fuel Payment from the UK
ga: B’fhéidir go mbeadh roinnt pinsinéirí na RA a chónaíonn in Éirinn i dteideal Íocaíocht Bhreosla Geimhridh a fháil ón RA

source: You can find out more from gov.uk
ga: Féadfaidh tú teacht ar bhreis faisnéis ó gov.uk

source: Keeping well and warm in winter
ga: Coimeád folláin agus te sa gheimhreadh

source: Coping with cold weather can be difficult especially if you are older or have a disability or a long-term illness
ga: D’fhéadfadh sé a bheith deacair cur suas leis an aimsir fhuar, go háirithe má tá tú níos sine nó má tá tú faoi mhíchumas nó má tá breoiteacht fhadtéarmach ort

source: The Keeping Well and Warm website gives information and advice about the supports available to help you and your household keep well and warm during the winter
ga: Tugtar faisnéis agus comhairle ar an láithreán gréasáin ‘Keeping Well and Warm’ faoi na tacaíochtaí atá ar fáil chun cabhrú leat agus le do theaghlach coimeád folláin agus te i rith an gheimhridh

source: You may qualify for a Fuel Allowance if you are getting:
ga: D'fhéadfadh tú cáiliú do liúntas breosla má tú ag fáil:

source: • State Pension (Contributory) or State Pension (Non-Contributory)
ga: • Pinsean Stáit (Ranníocach) nó Pinsean Stáit (Neamh-Ranníocach)

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension or Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) Baintrí Mná nó Baintreach Fir nó Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: • Basic Supplementary Welfare Allowance for 456 days (over 15 months - it is paid on a 7-day week basis so 15 months’ payment is reached on day 455)
ga: • Liúntas Leasa Forlíontach bunúsach ar feadh 456 lá (tar éis 15 mhí – íoctar é ar bhonn seachtain 7 lá, mar sin, baintear íocaíocht 15 mhí amach ar lá 455)

source: • Jobseeker's Allowance (JA) for 391 days (over 15 months - it is paid on a 6-day week basis so 15 months’ payment is reached on day 390)
ga: • Liúntas Cuardaitheora Poist (LCP) ar feadh 391 lá (tar éis 15 mhí – íoctar é ar bhonn seachtain 6 lá, mar sin, baintear íocaíocht 15 mhí amach ar lá 390)

source: Fuel Allowance is payable to people who have been getting a jobseeker’s payment for 391 days, if they satisfy the relevant qualifying conditions
ga: Tá Liúntas Breosla iníoctha le daoine a raibh íocaíocht chuardaitheora poist á fáil acu ar feadh 391 lá, má shásaíonn siad na coinníollacha ábhartha cáilithe

source: Days of unemployment on Jobseeker's Benefit count towards the 391 days if the Jobseeker’s Benefit claim was immediately before the award of Jobseeker’s Allowance
ga: Cuirtear laethanta a chaitear le Sochar Cuardaitheora Poist a fháil san áireamh i dtreo na 391 lá má rinneadh éileamh ar Shochar Cuardaitheora Poist díreach sular bronnadh Liúntas Cuardaitheora Poist

source: You can keep your Fuel Allowance if you move from One-Parent Family Payment, Carer’s Allowance or Jobseeker’s Transitional payment to JA
ga: Féadfaidh tú do Liúntas Breosla a choimeád má aistríonn tú ó Íocaíocht Teaghlach Aontuismitheora, Liúntas Cúramóra nó Íocaíocht Chuardaitheora Poist (Aistriú) go dtí LCP

source: • Death Benefit under the Occupational Injuries Scheme
ga: • Sochar Báis faoin Scéim Díobhálacha Ceirde

source: • Social Security Pension from an EE/EEA country or a country with whom Ireland has a bilateral social security agreement (provided there is an equivalent Irish payment)
ga: • Pinsean Slándála Sóisialaí ó thír EE/LEE nó ó thír a bhfuil comhaontú déthaobhach slándála sóisialaí ag Éirinn léi (a fhad agus go bhfuil íocaíocht chomhionann Éireannach ann)

source: • Or if you are taking part in certain schemes - Back to Work Allowance, Back to Work Enterprise Allowance (BTWEA), Rural Social Scheme, Tús, JobBridge, Revenue Job Assist or Community Employment and are entitled to keep your secondary benefits
ga: • Nó má tá páirt á glacadh agat i scéimeanna áirithe – Liúntas um Fhilleadh ar Obair, Liúntas Fiontraíochta um Fhilleadh ar Obair (LFFAO), an Scéim Shóisialta Tuaithe, Tús, JobBridge, Cúnamh Poist na gCoimisinéirí Ioncaim nó Fostaíocht Pobail agus má tá tú i dteideal do shochair thánaisteacha a choimeád

source: You live alone or only with:
ga: Maireann tú i do aonar nó amháin in éineacht le

source: • A dependent spouse, civil partner or cohabitant and/or dependent children
ga: • Céile cleithiúnach, páirtnéir sibhialta nó comháitritheoir agus/nó leanaí cleithiúnacha

source: • Other people getting one of the qualifying payments who would also be eligible for a Fuel Allowance in their own right
ga: • Daoine eile a bhfuil ceann de na híocaíochtaí cáilitheacha á bhfáil acu a bheadh incháilithe, chomh maith, do Liúntas Breosla ina gceart féin

source: • A person who is getting Carer's Allowance or Carer's Benefit and is caring for you or for your dependent spouse, partner or cohabitant
ga: • Duine a bhfuil Liúntas Cúramóra nó Sochar Cúramóra á fháil acu agus a bhfuil cúram á chur ar fáil acu duit nó do do chéile cleithiúnach, páirtnéir nó comháitritheoir

source: • A person getting short-term Jobseeker's Allowance or basic Supplementary Welfare Allowance
ga: • Duine a bhfuil Liúntas Cuardaitheora Poist gearrthéarmach nó Liúntas Leasa Forlíontach bunúsach á fháil acu

source: You and other members of your household are unable to provide for your heating needs from your own resources
ga: Níl tú féin agus daoine eile muinteartha in ann soláthar a dhéanamh do bhur riachtanais téimh as bhur n-acmhainní féin

source: You will not qualify for a Fuel Allowance if:
ga: Ní cháileoidh tú do Liúntas Breosla:

source: • Your heating needs are met under a deed transferring property
ga: • Má fhreastalaítear ar do riachtanais téimh faoi ghníomhas a aistríonn réadmhaoin

source: • You live with someone who is not getting one of the qualifying payments for the Fuel Allowance
ga: • Má chónaíonn tú le duine éigin nach bhfuil ceann de na híocaíochtaí cáilitheacha á bhfáil acu do Liúntas Breosla

source: • You are on a contributory payment and have income above the means test limits (see below)
ga: • Má tá íocaíocht ranníocach á fáil agat agus má tá ioncam agat a sháraíonn teorainneacha na tástála maoine (féach thíos)

source: Carer's Allowance is not a qualifying payment for Fuel Allowance
ga: Ní íocaíocht cháilitheach don Liúntas Breosla Liúntas Cúramóra

source: However you may qualify for Fuel Allowance if you are getting half-rate Carer's Allowance and another qualifying social welfare payment:
ga: Féadfaidh tú cáiliú do Liúntas Breosla, áfach, má tá Liúntas Cúramóra ar leathráta agus íocaíocht cháilitheach leasa shóisialaigh eile á bhfáil agat

source: • If you are getting a non-contributory social welfare payment and a half-rate Carer's Allowance then Fuel Allowance is payable (if you meet all the criteria)
ga: • Má tá íocaíocht neamh-ranníocach leasa shóisialaigh agus Liúntas Cúramóra ar leathráta á bhfáil agat, tá Liúntas Breosla iníoctha (má shásaíonn tú na critéir go léir)

source: • If you are getting a contributory social welfare payment and a half-rate Carer's Allowance then the value of the half-rate Carer's Allowance will be assessed in the means test for Fuel Allowance (see below)
ga: • Má tá íocaíocht ranníocach leasa shóisialaigh agus Liúntas Cúramóra ar leathráta á bhfáil agat, déanfar luach Liúntas Breosla ar leathráta a mheasúnú sa tástáil mhaoine do Liúntas Breosla (féach thíos)

source: Means test for Fuel Allowance
ga: Tástáil mhaoine le haghaidh Liúntas Breosla

source: Fuel Allowance is a means-tested payment
ga: Íocaíocht ar a ndéantar tástáil mhaoine is ea Liúntas Breosla

source: If you are getting a non-contributory payment you are accepted as satisfying the means test
ga: Má tá íocaíocht neamh-ranníocach á fáil agat, glactar leis go sásaíonn tú an tástáil mhaoine

source: If you are on an employment support scheme or if you are getting a Back to Education Allowance you are entitled to keep your Fuel Allowance if you continue to satisfy the conditions – including the means test
ga: Má tá tú rannpháirteach i scéim tacaíochta fostaíochta nó má tá Liúntas um Fhilleadh ar Oideachas á fháil agat, tá tú i dteideal do Liúntas Breosla a choimeád má leanann tú leis na coinníollacha a shásamh – an tástáil mhaoine san áireamh

source: The Fuel Allowance means test is linked to the maximum rate of the State Pension (Contributory)
ga: Tá tástáil mhaoine an Liúntais Bhreosla nasctha leis an ráta uasta den Phinsean Stáit (Ranníocach)

source: You can have a combined weekly income of €100 above the maximum State Pension (Contributory) for your situation and still be eligible for a Fuel Allowance
ga: Féadfaidh tú comhioncam seachtainiúil €100 a bheith agat os cionn an Phinsin Stáit (Ranníocach) le haghaidh do chúinsí agus fós bheith i dteideal Liúntas Breosla a fháil

source: This means that you can have capital/savings, providing they are less than €58,000, and be eligible for a Fuel Allowance
ga: Ciallaíonn seo gur féidir leat caipiteal/coigiltí a bheith agat, a fhad agus níos lú ná €58,000 iad, agus bheith i dteideal Liúntas Breosla a fháil

source: (€58,000 is equivalent to just over €100 a week under the capital means assessment rules.)
ga: (Is ionann €58,000 agus beagán de bhreis ar €100 sa tseachtain faoi rialacha na measúnachta ar mhaoin chaipitil.)

source: • The assessable income limit for a single person under 80 is €338.30 (€100 plus €238.30)
ga: • Is ionann an teorainn inmheasúnaithe ioncaim le haghaidh duine aonair faoi 80 agus €338.30 (€100 móide €238.30);

source: • The assessable income limit for a couple (where the qualified adult is under 66) is €497.10 (€100 plus €238.30 plus €158.80)
ga: • Is ionann an teorainn inmheasúnaithe ioncaim le haghaidh lánúine (sa chás gur faoi 66 bliain an duine fásta cáilithe) agus €497.10 (€100 móide €238.30 móide €158.80);

source: • The assessable income limit for a couple (where the qualified adult is 66 or over) is €551.80 (€100 plus €238.30 plus €213.50)
ga: • Is ionann an teorainn inmheasúnaithe ioncaim le haghaidh lánúine (sa chás gurb os cionn 66 bliain an duine fásta cáilithe) agus €551.80 (€100 móide €238.30 móide €213.50);

source: If you are over 80, add an extra €10 to the appropriate DSP payment rate
ga: Más os cionn 80 atá tú, is féidir leat €10 a shuimiú le ráta cuí íocaíochta na RCS

source: Getting a pension or benefit from another country
ga: Ag fágáil pinsean nó sochar ó thír eile

source: If you are getting a pension/benefit or equivalent payment from a country covered by EU Regulations or a country with which Ireland has a Bilateral Social Security Agreement (provided there is an equivalent Irish payment), you may qualify for a Fuel Allowance provided you satisfy the qualifying conditions mentioned above and you are:
ga: Má tá pinsean/sochar nó íocaíocht choibhéiseach dhá íoc leat ó thír atá clúdaithe ag Rialacháin an AE nó tír a bhfuil Comhaontú Déthaobhach Leasa Shóisialaigh ag Éirinn léi, d’fhéadfadh sé go gcáileodh tú don liúntas breosla má shásaíonn tú na coinníollacha cáilitheacha a bhfuil tagairt déanta dóibh thuas agus go bhfuil tú:

source: • Aged 66 or over
ga: • Go bhfuil tú 66 bliain d'aois nó ós a chionn

source: • Under 66 and getting an Invalidity Pension (for over 12 months), a Widow's, Widower's or Surviving Civil Partner's Pension or an equivalent payment from another country
ga: • Go bhfuil tú faoi 66 bliain d'aois agus Pinsean Easláinte dhá íoc leat (le ós cionn 12 mí), Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh nó íocaíocht choibhéiseach ó thír eile

source: Where more than one person in a household qualifies
ga: Má cháilíonn níos mó ná duine amháin sa teaghlach

source: Only one Fuel Allowance payment will be paid to a household
ga: Ní íocfar ach íocaíocht Liúntais Bhreosla amháin le teaghlach

source: If two or more people who each qualify for a Fuel Allowance are living in the same household, a single Fuel Allowance is paid to one qualified person in that household
ga: Má tá beirt ina gcónaí in aon teaghlach agus go gcáilíonn siad araon don liúntas breosla, ní íocfar ach liúntas breosla amháin le duine cáilithe amháin sa teaghlach sin

source: The table shows who should apply for a Fuel Allowance in the case of two or more qualifying individuals living in the same house
ga: Leagann an tábla thíos amach an duine cáilitheach iomchuí sa líon tí ar chóir dó/dí iarratas a dhéanamh ar an liúntas breosla sa chás go bhfuil beirt nó níos mó daoine cáilitheacha ina gcónaí sa teach céanna

source: Payment Person who should apply for the fuel allowance
ga: Íocaíocht Daoine ar chóir dóibh iarratas a dhéanamh ar an liúntas breosla

source: Social welfare pension and long-term Jobseeker's Allowance Social welfare pensioner
ga: Pinsean leasa shóisialaigh agus Liúntas Cuardaitheora Poist fadthéarmaí Pinsinéir leasa shóisialaigh

source: Pre-Retirement Allowance and social welfare pension Social welfare pensioner
ga: Liúntas Réamh-Scoir agus pinsean leasa shóisialaigh Pinsinéir leasa shóisialaigh

source: Pre-Retirement Allowance and long-term Jobseeker's Allowance Person receiving Pre-Retirement Allowance
ga: Liúntas Réamh-Scoir agus Liúntas Cuardaitheora Poist fadthéarmaí Duine ar Liúntas Réamh-Scoir

source: Social welfare pension and social security payment from another country Social welfare pensioner
ga: Pinsean leasa shóisialaigh agus íocaíocht leasa shóisialaigh ó thír eile Pinsinéir leasa shóisialaigh

source: Social security payment from another country and Long-term Jobseeker's Allowance Social security pensioner
ga: Íocaíocht leasa shóisialaigh ó thír eile agus Liúntas Cuardaitheora Poist fadthéarmaí Pinsinéir leasa shóisialaigh

source: The Fuel Allowance is €22.50 per week
ga: Is é an Liúntas Breosla ná €22.50 sa tseachtain

source: To apply for Fuel Allowance, fill in application form NFS 1 (pdf)
ga: Chun iarratas ar Liúntas Breosla a dhéanamh, comhlánaigh an fhoirm iarratais NFS 1 (pdf)

source: This application form is also available from your local post office
ga: Tá an fhoirm iarratais seo le fáil ó d’oifig phoist áitiúil

source: If you apply for the Fuel Allowance after the start of the heating season (in October), the allowance will not be backdated
ga: Má dhéanann tú iarratas ar an liúntas breosla tar éis túis an séasúir téite (an seachtain dheireanach Meán Fómhair), ní íocfar an liúntas siar go dáta

source: If you are getting a payment from the Department of Social Protection or a social security payment from a country covered by EC Regulations or a country with which Ireland has a Bilateral Social Security Agreement, the Fuel Allowance will be included in your weekly payment
ga: Má tá íocaíocht dhá fháil agat ón Roinn Coimirce Sóisialaí nó pinsean/sochar leasa shóisialaigh ó thír atá clúdaithe ag Rialacháin an AE nó tír a bhfuil Comhaontú Déthaobhach Leasa Shóisialaigh ag Éirinn léi, íocfar do liúntas breosla trí leabhar orduithe íocaíochtaí nó leabhar ilchodach, más féidir

source: You do not need to reapply for the Fuel Allowance each year as long as, your circumstances remain the same and you continue to get the same social welfare payment
ga: Mura n-athraíonn do chúinsí agus má leanann tú an íocaíocht leasa shóisialaigh céanna a fháil, ní gá duit iarratas ar an Liúntas Breosla a dhéanamh gach bliain

source: If you are not getting a social welfare payment, your Fuel Allowance can be paid directly into your account in a financial institution or you can collect the allowance at your local post office
ga: Mura bhfuil íocaíocht leasa shóisialaigh á fáil agat, is féidir do Liúntas Breosla a íoc go díreach isteach i do chuntas in institiúid airgeadais nó féadfaidh tú an liúntas a bhailiú ag oifig an phoist áitiúil

source: Complete and return the form to the section that pays your payment, as set out below
ga: Comhlánaigh an fhoirm agus cuir ar ais í chuig an rannán íocaíochta cuí faoi mar atá leagtha amach thíos:

source: │Payment │Send your application to: │
ga: │Má tá íocaíocht á fháil agat mar a leanas: │Seol d'iarratas chuig: │

source: │ │Department of Social Protection │
ga: │ │An Roinn Coimirce Sóisialaí │

source: │ │Social Welfare Services Office │
ga: │ │Oifig na Seirbhísí Leasa Shóisialaigh │

source: │ • Invalidity Pension │Ballinalee Road │
ga: │ • Pinsean Easláinte │Bóthar Béal Átha na Lao │

source: │ • Disability Allowance │Longford │
ga: │ • Liúntas Míchumais │An Longfort │

source: │ • Incapacity Supplement │Ireland │
ga: │ • Forlíonadh Éagumais │Éire │

source: │ │Tel:(043) 334 0000 │
ga: │ │Teil:(043) 334 0000 │

source: │ │Locall:1890 927 770 │
ga: │ │Lóghlao:1890 927 770 │

source: │ • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension │ │
ga: │ • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach) │ │

source: │ • Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension │Social Welfare Services │
ga: │ • Sochar nó Liúntas Banchéile Thréigthe │Seirbhísí Leasa Shóisialaigh │

source: │ • Deserted Wife's Benefit or Allowance │College Road │
ga: │ • Pinsean Stáit (Ranníocach nó Neamh-Ranníocach) │Bóthar an Choláiste │

source: │ • State Pension (Contributory or Non-Contributory) │Sligo │
ga: │ • Pinsean na nDall │Sligeach │

source: │ • Blind Pension │Ireland │
ga: │ • Liúntas Banchéile Príosúnaigh │Éire │

source: │ • Guardian's Payment (Contributory) │ │
ga: │ • Íocaíocht do Theaghlach Aon-Tuismitheora │ │

source: │ • Guardian's Payment (Non-Contributory) │Opening Hours:This office does not offer a service to personal callers
ga: │ • Íocaíocht Chaomhnóra (Ranníocach) │Uaireanta Oscailte:Ní thairgeann an oifig seo seirbhís do chuairteoirí pearsanta

source: All queries must be made using the online enquiry form, by telephone or in writing
ga: Caithfidh gach ceist a bheith cur isteach tríd an fhoirm fiosraithe ar líne a úsáid, tríd an teileafón nó i scríbhinn

source: │ • Prisoner's Wife's Allowance │Tel:(071) 915 7100 │
ga: │ • Íocaíocht Chaomhnóra (Neamh-Ranníocach) │Teil:(071) 915 7100 │

source: │ │Locall:1890 500 000 │
ga: │ • Liúntas Banchéile Príosúnaithe │Lóghlao:1890 500 000 │

source: │ • Long-term Jobseeker's Allowance (15 months) │ │
ga: │ • Liúntas Cuardaitheora Poist │ │ │ │ │

source: │ • Farm Assist │Send your completed form to your social welfare local office
ga: │ • Cúnamh Feirme │Ba chóir duit do fhoirm chomhlánaithe a sheoladh chuig d'oifig leasa shóisialaigh áitiúil

source: │ • One-Parent Family Payment or Jobseeker's Transitional payment │ │
ga: │ • Íocaíocht Theaghlaigh Aontuismitheora │ │

source: │ • Long-term Supplementary Welfare Allowance (15 months) │Apply to the Department of Social Protection's representative (formerly known as the Community Welfare Officer) at your local office
ga: │ • Liúntas Leasa Forlíontach (15 mí) │Ba chóir duit iarratas a dhéanamh chuig an Oifigeach Leasa Pobail ag d’ionad nó d’oifig áitiúil
